package com.yeyouliang.lanqiao;

/**
 * Created by YYL on 2021/5/14 : 21:02.
 */
public class CastDice {
    /**
     * 给空白骰子写数字
     * 小明参加了少年宫的一项趣味活动：每个小朋友发给一个空白的骰子（它的6个面是空白的，没有数字），要小朋友自己设计每个面写哪个数字。但有如下要求：
     * 1. 每个面只能填写 0 至 8 中的某一个数字。
     * 2. 不同面可以填写同样的数字，但6个面总和必须等于24。
     * 填好后，小朋友可以用自己填写好数字的骰子向少年宫的两个机器人挑战----玩掷骰子游戏。规则如下：
     * 三方同时掷出自己的骰子，如果出现任何相同的数字，则三方都不计分。
     * 如果三方数字都不同，则最小数字一方扣 1 分，最大数字一方加 1 分。
     * 小明看到了两个机器人手中的骰子分别是：
     * 0 0 0 8 8 8
     * 1 1 4 5 6 7
     * 请你替小明算一下，他如何填写，才能使自己得分的概率最大。
     * 请提交小明应该填写的6个数字，按升序排列，数字间用一个空格分开。
     * 如果认为有多个答案，提交字母序最小的那个方案。
     * 请严格按照格式，通过浏览器提交答案。
     * 注意：只提交一行内容，含有6个被空格分开的数字。不要写其它附加内容，比如：说明性的文字。
     * 解：一定要有8不然永远无法得分，但是越少越好，不然更容易命中第一个规则。一定不能有0，会扣分。2或3尽可能多，如果不能仅由2，3，8组成，慢慢添加4-7，从小到大。
     */
    public static void main(String[] args) {
        int ci = 0;
        for (int i = 1; i < 7; i++) {//8
            ci += 8;
            int cj = 0;
            for (int j = 0; j < 7 - i - 1; j++) {//7
                cj += 7;
                int ck = 0;
                for (int k = 0; k < 7 - i - j - 1; k++) {//6
                    ck += 6;
                    int cl = 0;
                    for (int l = 0; l < 7 - i - j - k - 1; l++) {//5
                        cl += 5;
                        int cm = 0;
                        for (int m = 0; m < 7 - i - j - k - l - 1; m++) {//4
                            cm += 4;
                            int cn = 0;
                            for (int n = 0; n < 7 - i - j - k - l - m - 1; n++) {//3
                                cn += 3;
                                int co = 0;
                                for (int o = 0; o < 7 - i - j - k - l - m - n - 1; o++) {//2
                                    co += 2;
                                }
                                if (8 * i + 7 * j + 6 * k + 5 * l + 4 * m + 3 * n + co == 24) {
                                    System.out.println("8*" + i + "+7*" + j + "+6*" + k + "+5*" + l + "+4*" + m + "+3*" + n + "+2*" + co/2);
                                    return;
                                }
                            }
                            if (8 * i + 7 * j + 6 * k + 5 * l + 4 * m + cn == 24) {
                                System.out.println("8*" + i + "+7*" + j + "+6*" + k + "+5*" + l + "+4*" + m + "+3*" + cn/3);
                                return;
                            }
                        }
                        if (8 * i + 7 * j + 6 * k + 5 * l + cm == 24) {
                            System.out.println("8*" + i + "+7*" + j + "+6*" + k + "+5*" + l + "+4*" + cm/4);
                            return;
                        }
                    }
                    if (8 * i + 7 * j + 6 * k + cl == 24) {
                        System.out.println("8*" + i + "+7*" + j + "+6*" + k + "+5*" + cl/5);
                        return;
                    }
                }
                if (8 * i + 7 * j + ck == 24) {
                    System.out.println("8*" + i + "+7*" + j + "+6*" + ck/6);
                    return;
                }
            }
            if (8 * i + cj == 24) {
                System.out.println("8*" + i + "+7*" + cj/7);
                return;
            }
        }
        if (ci == 24) {
            System.out.println("ci=" + ci);
        }
    }
}
